In [1]:
#Assignment 1 : Zip file extraction and printing all the contents of the files inside the zip file
import zipfile

In [7]:
with zipfile.ZipFile('zippy.zip') as file:
    filelist = file.namelist()
    print(filelist)
    file.extractall()

['one.txt', 'three.txt', 'two.txt']

In [11]:
for files in filelist:
    print("Filename  --",files,"\n")
    f=open(files, "r")
    if f.mode == 'r': 
        contents =f.read()
    print(contents,"\n")

Filename  -- one.txt

Hii this is the first file
and i am divya

Filename  -- three.txt

awww,
the third one..
bye

Filename  -- two.txt

HOO OOOOOHHH
this is the second file
and i am so excited

In [19]:
#generating a 16 digit random number
import random
random.randint(1000000000000000,9999999999999999)

1817281491888938

In [12]:
#Assignment 2 : csv file with data employee
#and sort it by emp id
#two arrays having roll no and names
#class of roll no and name and create array of class 
import pandas as pd
data = pd.read_csv("employeedetails.csv")
data.head()

   id    name   department       dob
0  34     div      finance  28/11/97
1  54    arav           hr  17/06/93
2  33  sravya  development  23/08/97
3  21   dhruv      finance  04/11/98
4  67    bala      finance  29/01/95

In [16]:
data.sort_values(by=["id"])

    id      name   department       dob
3   21     dhruv      finance  04/11/98
2   33    sravya  development  23/08/97
0   34       div      finance  28/11/97
1   54      arav           hr  17/06/93
6   55      mala           hr  04/04/97
8   56      vaga           hr  03/12/96
4   67      bala      finance  29/01/95
7   87      siva           hr  02/09/98
5  234  dharshna           hr  03/06/95

In [1]:
Rollno = [1600, 1611,1623,1604,1701,1103,1620,1650,1688]
Name = ['a','b','c','d','e','f','g','h','i']

In [2]:
class Empdetails:
    def __init__(self, rollno, name):
        self.name = name
        self.rollno = rollno

In [4]:
#for roll,nam in zip(Rollno,Name):
    
instancelist =  [Empdetails(roll,nam) for roll,nam in zip(Rollno,Name)]

In [18]:
for i in range(9):
    print(instancelist[i].rollno, instancelist[i].name)

1600 a
1611 b
1623 c
1604 d
1701 e
1103 f
1620 g
1650 h
1688 i